// Задача 67:
// Напишите программу, которая будет принимать на вход число
// и возвращать сумму его цифр.

// 453 -> 12
// 45 -> 9

// Факториал
// int Factorial(int n)
// {
//     if (n==1) return 1;
//     else return n * Factorial(n -1);
// }
// Console.WriteLine(Factorial(3));

int SumDigits(int num)
{    
    if (num == 0) return 0;
    else return num %10 + SumDigits(num / 10);    
}

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());

int sumDigits = SumDigits(number);
Console.WriteLine(sumDigits);